Tekla.Structures.Dialog.UIControls.MaterialSelectionForm
The MaterialSelectionForm class represents a dialog to select materials
using the material catalogs.

Tekla.Structures.Dialog.UIControls.MaterialSelectionForm.#ctor(System.Collections.Generic.List{Tekla.Structures.Catalogs.MaterialItem})
Creates a new instance of the MaterialSelectionForm.
Materials: The materials to be added to the dialog.

Tekla.Structures.Dialog.UIControls.MaterialSelectionForm.#ctor(System.Collections.Generic.List{Tekla.Structures.Catalogs.MaterialItem},System.String)
Creates a new instance of the MaterialSelectionForm, selecting the given material in the tree control.
Materials: The materials to be added to the dialog.
Material: The material to be selected in the tree.

Tekla.Structures.Dialog.UIControls.MaterialSelectionForm.OnLoad(System.EventArgs)
When the load event is raised, the tree in the dialog is filled with the materials.
The create dialog is only localized when it is not in design mode,
meaning it is shown without localization in Visual Studio.
EventArgs: The event arguments.

Tekla.Structures.Dialog.UIControls.MaterialSelectionForm.SelectedMaterial
The selected material in the control.

Tekla.Structures.Dialog.UIControls.MaterialSelectionForm.CreateNodeIfNeeded(System.String)
Creates a new node for material types if needed.

Tekla.Structures.Dialog.UIControls.MaterialSelectionForm.CreateNewNode(System.String,System.String)
Creates a new node for material.

Tekla.Structures.Dialog.UIControls.MaterialSelectionForm.components
Required designer variable.

Tekla.Structures.Dialog.UIControls.MaterialSelectionForm.Dispose(System.Boolean)
Cleans up any resources being used.
disposing: True if managed resources should be disposed; otherwise, false.

Tekla.Structures.Dialog.UIControls.MaterialSelectionForm.InitializeComponent
Required method for Designer support - do not modify
the contents of this method with the code editor.